
#include "msm_sensor.h"
#define HW_IMX135_SENSOR_NAME "hw_imx135"
DEFINE_MSM_MUTEX(hw_imx135_mut);

/*#define HUAWEI_KERNEL_CAMERA_DEBUG*/
#undef CDBG
#ifdef HUAWEI_KERNEL_CAMERA_DEBUG
#define CDBG(fmt, args...) pr_err(fmt, ##args)
#else
#define CDBG(fmt, args...) do { } while (0)
#endif

static struct msm_sensor_ctrl_t hw_imx135_s_ctrl;
static int8_t hw_imx135_module_id = -1;
#define HW_IMX135_LITEON 1
static struct msm_sensor_power_setting hw_imx135_power_setting[] = {
	{
		.seq_type = SENSOR_VREG,
		.seq_val = CAM_VDIG,
		.config_val = 0,
		.delay = 20,
	},
	{
		.seq_type = SENSOR_VREG,
		.seq_val = CAM_VIO,
		.config_val = 0,
		.delay = 0,
	},
	{
		.seq_type = SENSOR_VREG,
		.seq_val = CAM_VANA,
		.config_val = 0,
		.delay = 5,
	},
	{
		.seq_type = SENSOR_GPIO,
		.seq_val = SENSOR_GPIO_RESET,
		.config_val = GPIO_OUT_HIGH,
		.delay = 1,
	},
	{
		.seq_type = SENSOR_CLK,
		.seq_val = SENSOR_CAM_MCLK,
             /* formular to macro */
		.config_val = MSM_SENSOR_MCLK_24HZ,
		.delay = 1,
	},
	{
		.seq_type = SENSOR_I2C_MUX,
		.seq_val = 0,
		.config_val = 0,
		.delay = 0,
	},
};
static struct v4l2_subdev_info hw_imx135_subdev_info[] = {
	{
		.code = V4L2_MBUS_FMT_SBGGR10_1X10,
		.colorspace = V4L2_COLORSPACE_JPEG,
		.fmt = 1,
		.order = 0,
	},
};

static const struct i2c_device_id hw_imx135_i2c_id[] = {
	{HW_IMX135_SENSOR_NAME, (kernel_ulong_t)&hw_imx135_s_ctrl},
	{ }
};

static int32_t msm_hw_imx135_i2c_probe(struct i2c_client *client,
	const struct i2c_device_id *id)
{
	return msm_sensor_i2c_probe(client, id, &hw_imx135_s_ctrl);
}

static struct i2c_driver hw_imx135_i2c_driver = {
	.id_table = hw_imx135_i2c_id,
	.probe  = msm_hw_imx135_i2c_probe,
	.driver = {
		.name = HW_IMX135_SENSOR_NAME,
	},
};

static struct msm_camera_i2c_client hw_imx135_sensor_i2c_client = {
	.addr_type = MSM_CAMERA_I2C_WORD_ADDR,
};

static const struct of_device_id hw_imx135_dt_match[] = {
	{.compatible = "qcom,hw_imx135", .data = &hw_imx135_s_ctrl},
	{}
};

static uint8_t hw_imx135_cci_i2c_read(uint32_t addr)
{
    int32_t rc = -EFAULT;
    uint16_t data;
    rc = hw_imx135_s_ctrl.sensor_i2c_client->i2c_func_tbl->i2c_read(
        hw_imx135_s_ctrl.sensor_i2c_client, addr, &data, MSM_CAMERA_I2C_BYTE_DATA);
    if (rc < 0)
    {
        pr_err("%s:Fail!rc = %d, addr = 0x%x, data = 0x%x\n", __func__, rc, addr, data);
    }
    return (uint8_t)data;
}

static int32_t hw_imx135_cci_i2c_write(uint32_t addr, uint8_t data)
{
    int32_t rc = -EFAULT;

    rc = hw_imx135_s_ctrl.sensor_i2c_client->i2c_func_tbl->i2c_write(
        hw_imx135_s_ctrl.sensor_i2c_client, addr, data, MSM_CAMERA_I2C_BYTE_DATA);
    if (rc < 0)
    {
        pr_err("%s:Fail!rc = %d, addr = 0x%x, data = 0x%x\n", __func__, rc, addr, data);
    }
    return rc;
}

/********************************OTP INFO START************************************/
typedef enum {
    //Lot No. data
    OTP_PAGE_0 = 0,
    //LSC
    OTP_PAGE_1,
    OTP_PAGE_2,
    OTP_PAGE_3,
    OTP_PAGE_4,
    OTP_PAGE_5,
    OTP_PAGE_6,
    OTP_PAGE_7,
    OTP_PAGE_8,
    //WB and ID
    OTP_PAGE_9,
    OTP_PAGE_10,
    OTP_PAGE_11,
    OTP_PAGE_12,
    //VCM
    OTP_PAGE_13,
    OTP_PAGE_14,
    OTP_PAGE_15,
    OTP_PAGE_16,
    OTP_PAGE_MAX,
} otp_page;

typedef enum {
    OTP_TYPE_ID_WB = 0,
    OTP_TYPE_VCM,
    OTP_TYPE_MAX,
} otp_type;

typedef struct opt_id_wb {
    /* Module information */
    uint8_t year;    /*0x3B04*/
    uint8_t month;    /*0x3B05*/
    uint8_t day;    /*0x3B06*/
    uint8_t cam_code;/*0x3B07*/
    uint8_t vend_ver;/*0x3B08*/

    /* WB parameters */
    uint8_t rg_h;    /*0x3B09*/
    uint8_t rg_l;    /*0x3B0A*/
    uint8_t bg_h;    /*0x3B0B*/
    uint8_t bg_l;    /*0x3B0C*/
    uint8_t gbgr_h;    /*0x3B0D*/
    uint8_t gbgr_l;    /*0x3B0E*/
} otp_id_wb_t;

/* VCM parameters */
typedef struct otp_vcm {
    uint8_t start_curr_h;    /*0x3B04*/
    uint8_t start_curr_l;    /*0x3B05*/
    uint8_t infinity_curr_h;/*0x3B06*/
    uint8_t infinity_curr_l;/*0x3B07*/
    uint8_t macro_curr_h;    /*0x3B08*/
    uint8_t macro_curr_l;    /*0x3B09*/
    uint8_t meter_curr_h;    /*0x3B0A*/
    uint8_t meter_curr_l;    /*0x3B0B*/
} otp_vcm_t;

#define IMX135_SENSOR_REG_LSC_ON    0x0700
#define IMX135_SENSOR_REG_LSC_ENABLE    0x4500
#define IMX135_SENSOR_REG_LSC_ADDR    0x4800
#define IMX135_SENSOR_REG_RAM_SEL_TOGGLE    0x3A63

#define IMX135_OTP_REG_MODE_ENABLE    0x3B00
#define IMX135_OTP_REG_STATUS_CHECK    0x3B01
#define IMX135_OTP_REG_PAGE_SELECT    0x3B02
#define IMX135_OTP_REG_CFA_FMT        0x3B2C
#define IMX135_OTP_REG_LOT_ID_START    0x3B24

#define IMX135_OTP_ID_WB_READ    (1 << 0)
#define IMX135_OTP_VCM_READ    (1 << 1)
#define IMX135_OTP_LSC_READ    (1 << 2)
#define IMX135_OTP_LSC_WRITED    (1 << 3)
#define IMX135_OTP_LSC_FILE_ERR    (1 << 4)

/* OTP lens shading parameters are 63*4[R-Gr-Gb-B] in toal, each parameter takes 2 bytes[9:0]. */
#define IMX135_OTP_LSC_SIZE    504
#define IMX135_OTP_LOTNO_SIZE    9
#define IMX135_OTP_LSC_LOTNO_SIZE    (IMX135_OTP_LSC_SIZE + IMX135_OTP_LOTNO_SIZE)

#define IMX135_OTP_LSC_FILE    "/data/lsc_param"

